[{"id":3,"title":"Turnover : le frein de l\u0027innovation","summary":"Turnover \u003d perte des connaissances \u003d repartir from scratch tous les x ans \u003d brider la force de proposition \u003d freiner l\u0027innovation","description":"Petite histoire de l\u0027entreprise qui boucle sur ses cycles de projet/maintenance, qui paye cher le renouvellement de son SI, et qui a toujours l\u0027impression d\u0027être à la traine en termes d\u0027innovation et de rentabilité...","nbVotes":65,"myVote":false,"interests":[35,27,12,17,18,16,33,34],"speakers":[13]},{"id":6,"title":"De l\u0027organisation X à l\u0027organisation Y","summary":"Comment transformer votre organisation ?","description":"Comment transformer votre organisation ?\r\nUn voyage de l\u0027organisation X vers l\u0027organisation Y (en référence aux thérories X et Y de Mc Gregor)...\r\n5 minutes pour préparer votre voyage !","nbVotes":44,"myVote":false,"interests":[27,18,40,44,42,41,34,45],"speakers":[17]},{"id":8,"title":"Coffeescript, comme Java en mieux ;)","summary":"OOP avec Coffeescript","description":"Depuis longtemps, les développeurs \"serveur\" ont de nombreux à priori vis à vis de Javascript :\r\n\r\n- un modèle objet \"particulier\" difficile à comprendre après des années de programmation orientée classes\r\n- un système d\u0027héritage par prototype générant beaucoup d\u0027effets de bord s\u0027il n\u0027est pas maîtrisé (sans compter la maintenabilité du code)\r\n- justement pas de classes en javascript, ce qui rend difficile l\u0027organisation du code (toujours d\u0027un point de vue approche \"classique\")\r\n\r\nL\u0027arrivée de CoffeeScript (langage \"au dessus\" de javascript, compilé en javascript) tend aujourd\u0027hui à gommer ces problématiques et tout particulièrement par l\u0027introduction d\u0027un système de classes qui prend en charge (pour/à la place du développeur) toutes les problématiques liées au modèle objet Javascript, garantissant ainsi la réduction de l\u0027apparition de bugs dus à la méconnaissance de javascript.","nbVotes":72,"myVote":false,"interests":[8,6,5,2,48],"speakers":[23]},{"id":27,"title":"Philanthropie et/ou performance","summary":"Contexte : dans le boulot","description":"Réflexions sur les divergences et les convergences entre les concepts de philanthropie et de performance. Une de mes réflexions en cours. ","nbVotes":24,"myVote":false,"interests":[27,43,84,75,82,42,41,34,45],"speakers":[25]},{"id":48,"title":"Atelier D\u0026CO, décoration de votre openspace","summary":"Extreme feeback devices, wallboards et autres idées pour animer votre bureau","description":"Vous en avez marre de voir votre intégration continue sans arrêt dans le rouge ? Fatigué(e) de voir ces tests rester en échec pendant de longues heures ? Pourquoi ne pas rendre visible à tous l’état de l’intégration continue ?\r\nAvec un peu d’imagination, du bricolage et du code bien sûr, il est possible d’impliquer et de responsabiliser tous les acteurs du projet en affichant son avancement, l’état des tests et bien d’autres indicateurs. Que ce soit avec un écran de télévision, une lampe à lave ou un lapin (?), il est facile d’animer et de rendre fun votre environnement de travail !","nbVotes":44,"myVote":false,"interests":[70,65,31],"speakers":[89]},{"id":49,"title":"Des objets à propriétés dynamiques","summary":"Avons-nous rendu nos systèmes aussi agiles que les méthodes qui nous ont servi à les créer ?","description":"Nombre d\u0027applications fournissent aux utilisateurs des objets dits \"standards\" mais le besoin évoluant, nous voyons régulièrement passer des demandes d\u0027ajouts de champs\r\ndans les formulaires, donc dans le système de stockage.\r\nCertaines applications (citons Alfresco par exemple) permettent la création de champs \"utilisateurs\" qui sont créés dynamiquement lors de l\u0027utilisation du système.\r\nHélas, leur implémentation est souvent plus pauvre que celle des objets fournis au déploiement (pas forcément pris en compte dans la recherche, etc.).\r\nAjoutons à cela que la gestion des relations n\u0027est que rarement prise en compte sur ce type de champ. \r\nAutrement-dit, les POJO traditionnels s\u0027avèrent assez peu dynamiques une fois l\u0027application déployée.\r\nAvec l\u0027arrivée des systèmes de stockage NoSQL, qui eux, n\u0027ont pas cette rigidité, peut-être le moment est-il venu de repenser notre couche objet de persitance.","nbVotes":46,"myVote":false,"interests":[27,146,36,2,48,11],"speakers":[183]},{"id":50,"title":"mongoDB concepts et outils","summary":"Un tour d\u0027horizon rapide des concepts et des outils clés autour de mongoDB","description":"Avec ce lightning talk je vous propose un tour d\u0027horizon rapide des concepts clés qui sous-tendent mongoDB, la base NoSQL avec le vent en poupe :\r\n{\r\nstockage : orienté document,\r\nrequêtes : { type :ad hoc, optimisation : par index},\r\ndisponibilité : { technique : réplication, atout : scalabilité }\r\n}\r\n\r\nJe présenterai également l\u0027outillage autour de mongoDB :\r\n{\r\nshell : javascript,\r\napi : { natif : drivers, tiers : frameworks}\r\n}\r\n","nbVotes":70,"myVote":false,"interests":[77,29],"speakers":[75]},{"id":51,"title":"Developer Experience","summary":"What it is, Why it matters, How to make it not suck","description":"We all know what “user experience” is and we know that it’s important. We analyze drop-off rates for sign-in flows, do A/B testing on color schemes, and organize user focus groups for new features. But we rarely talk about the “developer experience” - what we all go through each time we try to use a developer tool, library, or API. How do we decide what tool to use? Is it easy to integrate with our development environment? How flexible is the API? Where do we go when something goes wrong? Those are the sort of questions that we can ask to understand what it’s like for a developer to use a product - and where it can be improved. \r\n\r\nWhether you simply use developer products or you actually build one yourself, you should walk away from this talk with ideas on how to make a great developer experience - and why it matters.","nbVotes":57,"myVote":false,"interests":[134],"speakers":[9]},{"id":52,"title":"open source un jour, open source toujours","summary":"bref, j\u0027améliore mon produit pour pas un rond","description":"bon, \r\n\r\nje suis à la fois un scumMaster et une truffe en open source. \r\n\r\nUn jour, j\u0027ai eu envie d\u0027utiliser plein de trucs openSource qui pouvaient m\u0027aider sans que je puisse les aider.\r\n\r\nRetour d\u0027expérience sur ma courbe d\u0027apprentissage du pourquoi et comment j\u0027ai adopté ou exclu les technos (en vrac sans discrimination ) : jenkins  / maven / nexus / artifactory / sonar / netbeans  / izpack / cheff / puppet / infinytest / perl / git / etc.\r\n\r\nEt si on se posait un 5Why en 5mn pour comprendre si la décision est lié à la qualité intrinsèque du projet, son buzz, ou à la capacité d\u0027intégrer ce projet dans mon organisation?\r\n\r\nL.","nbVotes":26,"myVote":false,"interests":[27,163,3,15,70,16,2,130,114,14,11],"speakers":[139]},{"id":57,"title":"JavaFX 2 vs Javascript","summary":"La bataille est lancée","description":"Un sujet de pause-café mais pourtant très important dans la stratégie long-terme des entreprises ayant besoin de progiciels pérennes.\r\nQuels sont les enjeux macro-économiques derrière cette petite bataille de \u0027zealots\u0027.\r\nQuelles sont les différences de ces 2 technologies.\r\n\r\nCohabitation ou Monopole ? A nous de décider !","nbVotes":17,"myVote":false,"interests":[122,5,167,2,11],"speakers":[186]},{"id":61,"title":"HTML5 History: que l\u0027histoire ne se répète pas !","summary":"L\u0027utilité de l\u0027API History pour les applications utilisant intensivement AJAX","description":"A l\u0027heure où la plupart des sites et des applications Web utilisent des requêtes AJAX dans tous les sens, il est nécessaire de permettre à l\u0027utilisateur de continuer à utiliser les outils qu\u0027il aime dans son navigateur:\r\n- Les boutons Suivant et Précédent\r\n- Les bookmarks\r\nJe vous propose une présentation de la problématique et un résumé simple de cette API qui l\u0027est aussi (en théorie)","nbVotes":38,"myVote":false,"interests":[154,39,13],"speakers":[122]},{"id":69,"title":"La voie du programmeur","summary":"Faire du développement sa carrière semble bien délicat dans un monde vénérant les chefs de projet. ","description":"Le mythe du développeur pisseur de code coûte très cher. Il coûte la capacité d\u0027innovation d\u0027une société, et une dette technique non contrôlée. \r\nPourtant, vouloir faire du développement sa carrière relève du défit. Comment garder sa passion intacte ? ","nbVotes":73,"myVote":false,"interests":[183,182,41,131],"speakers":[207]},{"id":82,"title":"Sprint de plugins !","summary":"Présentation éclair de différents plugins pour vos IDE préférés","description":"Quoi de plus naturel que de vouloir _tuner_ son IDE ? En effet nous y passons beaucoup de temps, voilà pourquoi je vous propose de découvrir, en 5 minutes chrono, autant de plugins qu\u0027il sera possible pour Eclipse et IntelliJ IDEA.","nbVotes":21,"myVote":false,"interests":[187,186,64],"speakers":[263]},{"id":90,"title":"Edition logicielle et opensource","summary":"Conséquences pour un éditeur de l\u0027ouverture de son code source","description":"## Bref, je suis développeur libre ...\r\n\r\nSilverpeas est devenu un logiciel libre quittant son modèle privateur. Mais passer ainsi d\u0027un modèle \u0027classique\u0027 d\u0027édition à un modèle libre soulève de nombreuses questions pour lesquelles je proposerai nos réponses.\r\n  * Quels ont été les impacts d\u0027un tel changement d\u0027orientation ?\u003cbr/\u003e\r\n  * Les geekettes se pâment elles sur mon code ?\u003cbr/\u003e\r\n  * Quels ont été les impacts d\u0027un tel changement d\u0027orientation ?\u003cbr/\u003e\r\n  * La vie libre d\u0027un éditeur est elle vraiment différente ?\u003cbr/\u003e\r\n  * Quelle licence choisir ?\u003cbr/\u003e\r\n  * Comment doit s\u0027adapter l\u0027entreprise à un tel changement ?\u003cbr/\u003e\r\n  * Quelles sont les conséquences pour les développeurs ?\u003cbr/\u003e\r\n  * Je suis maintenant un développeur libre, ma vie a t elle changé ?\u003cbr/\u003e\r\n  * M\u0027offre t on plus de bières ?\u003cbr/\u003e\r\n","nbVotes":41,"myVote":false,"interests":[199,113,194,30,42,41,45],"speakers":[103]},{"id":107,"title":"Programatools: Des outils pour les enfants","summary":"Des outils et des jeux pour apprendre à programmer de manière ludique !","description":"Dans la foulée de \"Sfeir Programatoo\", des demi-journées de programmation proposées aux enfants, nous vous proposons de découvrir les outils que nous connaissons : Scratch, Smallbasic, Tortuescript, Kodu, Alice... Des pistes pour vous donner envie, quand vous rentrerez, de vous mettre devant avec votre enfant !\r\n\r\nPrésentation de Programatoo pour Devoxx: http://goo.gl/Y3wIW\r\n\r\nLightning Talk par Audrey Neveu \u0026 Aline Paponaud\r\n\r\n","nbVotes":18,"myVote":false,"interests":[205],"speakers":[49]},{"id":108,"title":"Le seul échec, c\u0027est celui de ne pas apprendre","summary":"Notre modèle social nous a imposé une certaine peur de l\u0027échec. Or l\u0027échec est primordial. Voyons en quoi.","description":"Ce lightning talk est une réflexion qui tend à joindre les points de vue donnés sur le sujet par Claire Blondel, lors de TedxLyon 2011, et Derek Sivers dans sa célèbre vidéo \"Why you need to fail\". \r\n\r\nLe modèle d\u0027éducation français pose un problème majeur : il communique à tous une peur de l\u0027échec. Et cette peur de l\u0027échec est certainement l\u0027une des raisons profondes des difficultés que notre société et notre économie rencontrent.\r\n\r\nQuelles sont les conséquences néfastes de cet aspect de notre personnalité ? Existe-t-il des  exemples de grandes réussites construites sur de petits échecs ? Enfin, qu\u0027est-ce que l\u0027échec peut nous apporter sur le plan personnel, et à l\u0027échelle de nos équipes de développement ?","nbVotes":47,"myVote":false,"interests":[27,206,182,207,42],"speakers":[306]},{"id":118,"title":"Et vous, comment implémentez vous GTD ?","summary":"GTD : méthode \u003d théorie. Et en pratique, vous faites comment vous ?","description":"Remontons quelques mois en arrière, David Allen m\u0027a promis par son livre de gagner en productivité, sans stress. Seulement, la méthode GTD, bien que pleine de bons conseils, reste encore très théorique sur certains points.\r\nCe lightning talk propose d\u0027échanger sur le sujet afin de partager nos approche de la méthode.","nbVotes":13,"myVote":false,"interests":[220,221],"speakers":[343]},{"id":119,"title":"can you control what you can measure ?","summary":"Vos équipes sont-elles performantes ? Chiffres à l\u0027appui ? Et par rapport à la concurrence ?  Et si toutes ces données étaient publiques ?","description":"“You can’t control what you can’t measure.” Cette citation célèbre de Tom DeMarco souligne toujours l\u0027urgence dans nos projets informatiques de répondre aux questions : quand ? pour quel prix ? avec quelle qualité ?\r\nCes questions correspondent aux enjeux auxquels sont soumises les DSI aujourd\u0027hui : réduire les couts, créer de la valeur, gagner du temps, maitriser les risques.\r\nEn fait, la question des métriques en informatique est aussi vieille que le domaine et cela fait plus de 30 ans, face à la \"crise du logiciel\", que le sujet agite les professionnels.\r\nDans la vie de tout les jours, la situation est contrastée : les \"KPIs\" sont à la mode, mais les études montrent pourtant que les métriques sont parmi les outils les moins utilisés. Est-ce parce que les données récoltées sont trop souvent d\u0027une utilité limitée ou trop couteuses à obtenir ?\r\nA travers cette session, nous nous intéressons aux métriques et kpis utilisés dans les autres DSI ? Comment mesurer la qualité ou la performance ? Quid de la satisfaction de vos utilisateurs ou de vos équipes ?\r\nPlus largement, que change la progression des approches lean, agile ou lean startup ? Est-ce vraiment si important de mesurer pour contrôler ? On a montré dans d\u0027autres domaines scientifiques, depuis Heisenberg en physique quantique ou l\u0027effet Hawthorne en psychologie sociale, comment l\u0027observation pouvait affecter le comportement du sujet observé : qu\u0027en est-il dans nos DSI ?\r\nEt que se passerait-il si toutes ces données étaient publiques ?","nbVotes":19,"myVote":false,"interests":[34,41,42,197,27,35,43,113,17,18,30,33,31],"speakers":[304]},{"id":120,"title":"Object Calisthenics","summary":"9 règles pour votre gymnastique objet","description":"Rémy Sanlaville et moi vous invitons à une séance gratuite de remise en forme de votre code objet !\r\n\r\nVous trouvez que votre code est trop lourd ? Vous transpirez après le codage de deux méthodes ?\r\nVous souhaitez retrouver une silhouette objet parfaite pour votre code ?\r\n\r\nAlors venez avec nous pour une séance gratuite de remise en forme de votre code objet !\r\n\r\nCette séance est largement inspiré \u003ca href\u003d\"http://www.cs.helsinki.fi/u/luontola/tdd-2009/ext/ObjectCalisthenics.pdf\"\u003eJeff Bay\u0027s chapitre\u003c/a\u003e dans \u003ca href\u003d\"http://pragprog.com/book/twa/thoughtworks-anthology\"\u003eThe Thoughtworks Anthology\u003c/a\u003e","nbVotes":17,"myVote":false,"interests":[183,48,216,31],"speakers":[154]},{"id":122,"title":"LDAP c\u0027est bon, mangez-en","summary":"Les annuaires LDAP sont partout et souvent sous utilisés, pourtant ils peuvent rendre d\u0027énormes services","description":"Les annuaires LDAP sont souvent considérés comme des briques d\u0027infrastructures, sans valeur ajoutée pour les applications finales. Et pourtant... Au delà des problématiques d\u0027authentification et de contrôle d\u0027accès, les annuaires fédèrent souvent des données d\u0027identité, d\u0027organisation, d\u0027inventaire, etc. Autant d\u0027informations cuciales pour une entreprise qu\u0027il faudrait savoir exploiter dans les applications mises à disposition des utilisateurs.\r\n\r\nCette conférence présentera rapidement le protocole LDAP ainsi que l\u0027utilisation qui peut en être fait.","nbVotes":8,"myVote":false,"interests":[157,204],"speakers":[295]},{"id":123,"title":"Les Core Protocols en apéritif","summary":"Venez goûter à des outils essentiels de communication pour équipe","description":"Je propose de vous présenter rapido l\u0027un de mes outils favoris à destination des équipes : les Core Protocols (des époux Mc Carthy). Par équipe, j\u0027entends une VRAIE équipe : c\u0027est à dire des personnes qui collaborent en vue de d\u0027atteindre un objectif partagé. Parce que c\u0027est dur de travailler en EQUIPE, j\u0027espère que ces outils vous faciliteront la tâche ;-) \r\n\r\nLa présentation s\u0027appuiera essentiellement sur une démo live de mise en oeuvre de deux de ces protocoles : le Decider et le Perfection Game. ","nbVotes":11,"myVote":false,"interests":[27,237,238,45,213],"speakers":[471]}]