[{"id":15,"title":"ZeroMQ is Magic from the Future","summary":"An introduction to ZeroMQ, the fast, smart, and massively scalable connectivity layer for applications in any language, on any platform.","description":"ØMQ (ZeroMQ, 0MQ, zmq) looks like an embeddable networking library but acts like a concurrency framework. It gives you sockets that carry whole messages across various transports like in-process, inter-process, TCP, and multicast. You can connect sockets N-to-N with patterns like fanout, pub-sub, task distribution, and request-reply. It\u0027s fast enough to be the fabric for clustered products. Its asynchronous I/O model gives you scalable multicore applications, built as asynchronous message-processing tasks. It has a score of language APIs and runs on most operating systems. ØMQ is from iMatix and is LGPL open source.","track": "Agility","interests":[],"speakers":[31]},{"id":5,"title":"Expérience des billes rouges","summary":"L’expérience des billes rouges (the red bead experiment) est un atelier conçu par William Edwards Deming.","description":"L’expérience des billes rouges (the red bead experiment) est un atelier conçu par William Edwards Deming pour illustrer les erreurs classiques du management par rapport aux phénomènes liés à un système, à l’organisation elle-même. Cette session permettra aux participants de rejouer l\u0027expérience et d\u0027échanger sur les 7 maladies mortelles des organisations et les 14 points pour la transformation d\u0027une entreprise définis par Deming.","interests":[40,44,34,41,42,27,35,43,17,18,26,16,30,33],"track": "Agility","speakers":[17]},{"id":10,"title":"Dans la peau du Manager Agile","summary":"L’ère du management 3.0 (agile et Lean) est annoncée. Entre opportunités et nécessité, le métier de manager est en pleine évolution...","description":"L’ère du management 3.0 (un management agile et Lean) est annoncée … entre opportunités et nécessité, le métier de manager est en pleine évolution.\r\nLe mode de management « Command \u0026 Control » issu du Taylorisme et de l’organisation scientifique du travail (OST) , avec sa vision appauvrie de l’Homme au Travail a montré ses limites; le manager agile explore de nouvelles dimensions pour garantir le succès de tous.\r\nCette session se propose d\u0027explorer ces nouvelles dimensions.","track": "Agility","interests":[],"speakers":[24]},{"id":13,"title":"Hibernate Search: un tigre dans son moteur","summary":"Hibernate Search s\u0027appuie sur Lucene pour offrir aux applications Hibernate un moteur de recherche puissant et intuitif à ses utilisateurs.","description":"Hibernate Search a pour objectif de rentre très facile l\u0027ajout d\u0027un moteur de recherche puissant aux applications. Toute la plomberie et la complexité sont pris en charge par le framework et laisse les développeurs se concentrer sur les règles de recherche spécifiques à leur application.\r\n\r\nDans cette présentation, vous découvrirez comment rajouter un moteur de recherche à vos applications et vous découvrirez les dernières nouveautés comment la recherche par facette et la recherche géolocalisée.","track": "Trendy","interests":[61,54,2],"speakers":[30]},{"id":11,"title":"Groovy 2.0 : Quoi de neuf doc ?","summary":" Les nouveautés de Groovy 2.0!","description":"Après un bref aperçu des fonctionnalités clés de Groovy 1.8, dont le support natif de JSON, l\u0027intégration de GPars pour vos besoin de concurrence, et pour des Domain-Specific Languages encore plus lisibles, nous plongerons dans les nouveautés de Groovy 2.0 !\r\n\r\nBeaucoup d\u0027utilisateurs de Groovy l\u0027utilisent comme un langage de script Java ou comme un \"meilleur Java\". Mais tous n\u0027ont pas besoin des librairies de Groovy ou des capacités dynamiques.  Dans le premier cas, Groovy devient plus modulaire avec des modules unitaires composables. Dans le second cas, Groovy 2 rajoute le \"static type checking\" pour vous assurer de la qualité de votre code et pour repérer les erreurs plus tôt à la compilation.\r\n\r\nD\u0027autre part, tout le monde n\u0027a pas besoin des fonctionnalités dynamiques tout le temps, et Groovy propose en plus la compilation statique. Avec elle, Groovy 2 génère du bytecode efficace, aussi rapide que Java, et vous permet de protéger les sections critiques de votre application du \"monkey patching\". Mais lorsque vous en avez besoin, les fonctionnalités dynamiques du langages sont plus performantes grâce au support d\u0027invoke dynamic du JDK 7.","track": "Techy","interests":[55],"speakers":[27]},{"id":7,"title":"Sky Castle Game","summary":"Le Sky Castle Game est basé sur le Kanban Game de Jon Jagger.","description":"Oyez ! Oyez ! La légende du Sky Castle Game : \"Il était une fois un Roi très puissant. Un jour il tomba éperdument amoureux et décida de construire le Château de ses rêves pour y accueillir sa Bien aimée. Il décida de faire appel aux Compagnons Agiles qui sont réputés pour faire ce que l’on veut, montrer l’état d’avancement et accepter les modifications dont on va nécessairement avoir besoin au fur et à mesure du chantier afin de satisfaire sa Belle. L’équipe recrute. En ferez-vous partie ?\"\r\n\r\nCet atelier dure 2 heures (minimum) et s\u0027adresse à tout public.\r\n\r\nIl a été précédemment joué à l\u0027Agile Tour Toulouse le 19 octobre, l\u0027Agile Tour Bordeaux le 21 octobre et la Scrum Night le 7 décembre 2011.","track": "Techy","interests":[10,40,42,34,41,27,35,17,18,26,16,30,33,31,45],"speakers":[18,16,20]},{"id":18,"title":"Programmation fonctionnelle avec JavaScript","summary":"Grâce aux closures, aux prototypes et au fait que les fonctions sont des objets, JS permet d\u0027obtenir du code pratique, lisible et élégant !","description":"Cette session explorera un certain nombre d\u0027exemples de programmation fonctionnelle avec JavaScript, déclinés principalement autour de l\u0027AOP : journalisation, retardement, limitation de fréquence, mais aussi combinaisons entre fonctions et, au moyen de passerelles avec d\u0027autres types natifs, quelques raccourcis de code aussi expressifs que concis.\r\n\r\nCe sera aussi l\u0027occasion de rappeler des notions fondamentales pour toute codebase JS un tant soit peu épaisse : binding, closures, prototypes, etc.\r\n\r\nLes exemples seront déclinés en JavaScript et en CoffeeScript, qui ajoute encore de la concision :-)","track": "Gamy","interests":[6,5,48],"speakers":[63]},{"id":14,"title":"Social Architecture 101","summary":"Introducing Social Architecture: how to design and build on-line communities.","description":"Social Architecture by analogy with conventional architecture, is the process, and the product, of planning, designing, and growing an on-line community. Social architectures, in the form of on-line communities, are the cultural and political symbols, and works of art of the Digital Society. The 21st century will be identified with its surviving social architectures.\r\n\r\nAs Social Architects, we participate in communities, we identify successful naturally-occurring patterns, or we develop new patterns, and we apply these deliberately to our own architectures. We apply psychology (our social instincts), economics (how we create common wealth through specialization and trade), politics (how we collect and share power), and technology (how we communicate). We continually adapt our toolkit based on new knowledge and experience. Our goal is to create on-line communities that accurately solve the problems we identify, that grow healthily, and that survive by themselves.\r\n\r\nAll successful communities are based on the inherent contract of mutual benefit. That is, it is possible to build a billion-dollar business based on volunteer labor, but only if every participant contributes for selfish reasons. Often participants do not realize, or care, that they are part of a community. However, every single act is economic. Thus, \"crowd sourcing\" (as the exploitation-for-profit of volunteer labor is sometimes called) only works when the crowd really wants to solve the problems you throw at it.\r\n","track": "Gamy","interests":[],"speakers":[31]},{"id":1,"title":"Create mobile application with PhoneGap","summary":"I\u0027ll explain my development strategy, why I chose PhoneGap, and what I\u0027ve learnt along the way.","description":"If you decide today that you want to create a mobile application, you have to decide on a development strategy - especially if you want to target multiple platforms.You can either learn to program from scratch for each platform or you can use a framework that abstracts on top of all of the platforms and reuses your existing web development knowledge - like Apache [PhoneGap](http://phonegap.com). If you decide to use [PhoneGap](http://phonegap.com/), you still have figure out whether to use a library specially designed for mobile applications - like *Sencha* or *jQuery mobile* - or use general libraries like *Zepto* or *jQuery*. There are a lot of decisions to make, and there\u0027s no one best strategy at this point in the game.","track": "Gamy","interests":[5,21,15,13],"speakers":[9]},{"id":12,"title":"Anatomie d\u0027une mission agile, saison 2","summary":"La réalité agile : retour d’expérience sur le déploiement agile au sein d’un grand éditeur de logiciel dans le milieu bancaire. ","description":"L’agile, tout le monde en parle, mais peu osent encore s’y lancer *véritablement*.\r\nIl plane une odeur de risque, d’étrangeté, qui freine les décideurs, les managers. \r\n\r\nL’objectif de cette session est de lever cet écran de fumée pour plonger concrètement au sein d’une application de l’agile dans un milieu que l’on estime habituellement rigide ou traditionaliste, le milieu bancaire.\r\n\r\nRentabilité, ROI, plan de carrière, supervision, définition du besoin, contraintes, risques, \"time to market\", réussite de certains processus, échecs d’autres, l’objectif de cette session est de décrire la réalité agile en démystifiant certaines idées et en répondant le plus concrètement possible aux questions souvent posées.","track": "Gamy","interests":[68,57,39,34,41,42,27,43,17,3,18,30,59,31],"speakers":[25]}]